# CannotCreateRevealIntegral Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CreationFailures..::..CannotCreateRevealIntegral Property
BuiltInFailures..::..CreationFailures Class See Also
---
Could not create integral reveal for wall instance. [Description]
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCreateRevealIntegral { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCreateRevealIntegral As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCreateRevealIntegral {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CreationFailures Class
Autodesk.Revit.DB Namespace